#include<stdio.h>
#include "menu.h"

void main_menu()       //主菜单
{
    printf("*********************************\n");
    printf("*****         主菜单        *****\n");
    printf("*****                       *****\n");
    printf("*****       1.搜索联系人    *****\n");
    printf("*****       2.新建联系人    *****\n");
    printf("*****       3.联系人菜单    *****\n");
    printf("*****       4.新建分组      *****\n");
    printf("*****       5.分组菜单      *****\n");
    printf("*****       6.排序设置      *****\n");
    printf("*****       0.退出          *****\n");
    printf("*****                       *****\n");
    printf("*********************************\n");
}

void person_menu()
{
    printf("*************************************\n");
    printf("*****         联系人菜单        *****\n");
    printf("*****                           *****\n");
    printf("*****      1.查看所有联系人     *****\n");
    printf("*****      2.修改联系人信息     *****\n");
    printf("*****      3.进行通话           *****\n");
    printf("*****      4.最近通话记录       *****\n");
    printf("*****      5.联系人通话记录     *****\n");
    printf("*****      6.清除通话记录       *****\n");
    printf("*****      7.删除联系人         *****\n");
    printf("*****      0.返回主菜单         *****\n");
    printf("*****                           *****\n");
    printf("*************************************\n");
}

void group_menu()
{
    printf("*************************************\n");
    printf("*****          分组菜单         *****\n");
    printf("*****                           *****\n");
    printf("*****       1.查看所有分组      *****\n");
    printf("*****       2.添加到分组        *****\n");
    printf("*****       3.修改分组名称      *****\n");
    printf("*****       4.移除分组联系人    *****\n");
    printf("*****       5.删除分组          *****\n");
    printf("*****       0.返回主菜单        *****\n");
    printf("*****                           *****\n");
    printf("*************************************\n");
}

void sort_menu()
{
    printf("*********************************\n");
    printf("*****       排序设置        *****\n");
    printf("*****                       *****\n");
    printf("*****     1.联系人排序      *****\n");
    printf("*****     2.分组排序        *****\n");
    printf("*****     0.返回主菜单      *****\n");
    printf("*****                       *****\n");
    printf("*********************************\n");
}

void person_option()
{
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("~~~~~      修改选项     ~~~~~\n");
    printf("~~~~~                   ~~~~~\n");
    printf("~~~~~       1.名称      ~~~~~\n");
    printf("~~~~~       2.电话      ~~~~~\n");
    printf("~~~~~       3.地址      ~~~~~\n");
    printf("~~~~~       4.邮箱      ~~~~~\n");
    printf("~~~~~       0.取消      ~~~~~\n");
    printf("~~~~~                   ~~~~~\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}

void person_sort()
{
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("~~~~~         联系人排序       ~~~~~\n");
    printf("~~~~~                          ~~~~~\n");
    printf("~~~~~       1.默认排序         ~~~~~\n");
    printf("~~~~~       2.名称a-z排序      ~~~~~\n");
    printf("~~~~~       3.名称z-a排序      ~~~~~\n");
    printf("~~~~~       0.取消             ~~~~~\n");
    printf("~~~~~                          ~~~~~\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}

void group_sort()
{
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
    printf("~~~~~         分组排序         ~~~~~\n");
    printf("~~~~~                          ~~~~~\n");
    printf("~~~~~       1.默认排序         ~~~~~\n");
    printf("~~~~~       2.名称a-z排序      ~~~~~\n");
    printf("~~~~~       3.名称z-a排序      ~~~~~\n");
    printf("~~~~~       0.取消             ~~~~~\n");
    printf("~~~~~                          ~~~~~\n");
    printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}

int menu(MENU fp)
{
    fp();
    printf("请输入序号>>");
    char input = '0';
    scanf("%c",&input);
    fflush(stdin);
    return ((int)input-48);   // *用char来强制转换能解决输入字符时退出的问题
}